addpath('/usr/local/class/object/MATLAB/sift');
imglist={'kinkaku1.jpg','kinkaku2.jpg','kinkaku3.jpg','ginkaku1.jpg','ginkaku2.jpg','ginkaku3.jpg','eiffel1.jpg','eiffel2.jpg','eiffel3.jpg','TajMaharu1.jpg','TajMaharu2.jpg','TajMaharu3.jpg'};

[m,n]=size(imglist);%imglistにある画像の数をnとして取り出す
similarity=zeros(n,n);%類似度行列の初期化

for i=1:n
    I1=im2double(rgb2gray(imread(imglist{i})));
    [pnt1,desc1]=sift(I1);
    siftpnts1=size(pnt1,2);%画像の特徴点
    for j=1:n
      I2=im2double(rgb2gray(imread(imglist{j})));
      [pnt2,desc2]=sift(I2);
      siftpnts2=size(pnt2,2);
      match_betI1I2=siftmatch(desc1,desc2);
      [temp,corrpnts]=size(match_betI1I2);%対応点をcorrpntsとして取り出す
      similarity(i,j)=corrpnts/((siftpnts1+siftpnts2)/2);
    end
end
disp(similarity);%類似度行列の表示

%類似度比較に用いた画像の表示
for k=1:n
subplot(3,4,k),imshow(imglist{k});
end

%実行例
    %1.0000    0.0631    0.0496    0.0563    0.0600    0.0550    0.0282    0.0468    0.0273    0.0353    0.0589    0.0237
    %0.0421    1.0000    0.0588    0.0447    0.0553    0.0483    0.0352    0.0377    0.0285    0.0402    0.0190    0.0170
    %0.0345    0.0417    1.0000    0.0649    0.0830    0.0402    0.0140    0.0474    0.0318    0.0466    0.0560    0.0159
    %0.0281    0.0417    0.0464    1.0000    0.3213    0.2026    0.0246    0.0332    0.0327    0.0255    0.0387    0.0081
    %0.0384    0.0304    0.0258    0.2888    1.0000    0.1886    0.0161    0.0436    0.0166    0.0236    0.0354    0.0124
    %0.0306    0.0092    0.0355    0.1797    0.1939    1.0000    0.0312    0.0214    0.0321    0.0315    0.0391    0.0069
    %0.0400    0.0217    0.0364    0.0561    0.0579    0.0156    1.0000    0.1166    0.1000    0.0288    0.0251    0.0168
    %0.0062    0.0151    0.0277    0.0499    0.0775    0.0179    0.0699    1.0000    0.0113    0.0329    0.0234    0.0018
    %0.0252    0.0238    0.0294    0.0476    0.0331    0.0230    0.1162    0.0527    1.0000    0.0402    0.0433    0.0057
    %0.0287    0.0452    0.0648    0.0542    0.0383    0.0339    0.0201    0.0247    0.0301    1.0000    0.0893    0.1435
    %0.0400    0.0407    0.0504    0.0773    0.0548    0.0417    0.0220    0.0421    0.0433    0.0807    1.0000    0.0474
    %0.0316    0.0454    0.0491    0.0532    0.0619    0.0500    0.0413    0.0255    0.0524    0.2064    0.0872    1.0000

%実行例の中で特に10~12行目のタージ・マハルの画像の類似度は同じタージ・マハルの画像のグループの方が異なるグループの画像よりも
%類似度の高さが比較的分かりやすくうかがえる.