%round: 四捨五入をして整数または少数(第二引数を指定して)に丸める.
roundtest=[1.5,2.2,3.4,4.8,5.91];
roundtest2=[1.53,2.27,3.56,4.14,5.96];
roundtest3=[5.874,8.456,10.48,3.212,6.751];
disp(round(roundtest));
disp(round(roundtest2,1));%小数点第1位で丸める
%有効数字3桁で丸める
%左端の桁から丸めるには'siginificant'を指定する
disp(round(roundtest3,3,'significant'))

%round 実行例
%kadai2
%     2     2     3     5     6
% 1.5000    2.3000    3.6000    4.1000    6.0000
% 5.8700    8.4600   10.5000    3.2100    6.7500

%--------------------fix----------------------------
%fix:fix()内の要素が0に近くなるようにに丸める

fixtest=[-5.4 6.3; 10.8 -9.24; 3.5 6.23];
fixtest2=[-1.25+0.5i 2.52-3.3i; 5.3+10.6i 0.2-0.1i];
disp(fix(fixtest));
disp(fix(fixtest2));

%fix 実行例
%  -5     6
%  10    -9
%   3     6

% -1.0000 + 0.0000i   2.0000 - 3.0000i
%   5.0000 +10.0000i   0.0000 + 0.0000i


%----------------------mod----------------------------

%mod:  mod(a,m) として a を m で割ったときの余りを返す.

disp(mod(14,3))
modtest=[2 5 8 11];
modtest2=[-5 6 -2 -9];
disp(mod(modtest,4));
disp(mod(modtest2,2));
disp(mod(modtest2,-2));

%mod実行例

 %mod(14,3)の結果
 %2
 
 % 配列modtestに対する実行結果
 %  2     1     0     3
 
 % 序数を2にしたときのmodtest2に対する結果
 %  1     0     0     1
 
 % 序数を-2にしたときのmodtest2に対する結果
 %   -1     0     0     -1

%-----------------------prod--------------------------
%prod: 配列要素の積を求める
prodtest=[1.,2.,3.,4.,5.];
prodtest2=[1:2:5; 5:2:9; 9:2:13];
disp(prod(prodtest));
disp(prodtest2);
disp(prod(prodtest2));
disp(prod(prodtest2,2));%行方向に積を求める

%prod実行例
 %120 配列prodtestの計算結果
  
 %配列prodtest2の内容
  %   1     3     5
  %   5     7     9
  %   9    11    13

  % 45   231   585 %prodtest2の列方向の計算結果

  %prodtest2の行方向の計算結果
  %      15
  %     315
  %    1287

  %----------------------mean---------------------------
%mean:配列の平均値を返す
meantest=[1.,2.,3.,4.,5.];
meantest2=[1:3 ; 4:6; 7:9];
meantest3=[1:0.5:2; 2:0.5:3 ;3:0.5:4];

%mean実行例
disp(mean(meantest));
disp(meantest2);
disp(mean(meantest2));
disp(meantest3);
disp(mean(meantest3,2));%行方向に平均を求める

%3 meantest結果

%meantest2の内容
%    1     2     3
%    4     5     6
%    7     8     9

%meantest2の平均値の計算結果
%     4     5     6

%meantest3の内容
%  1.0000    1.5000    2.0000
%  2.0000    2.5000    3.0000
%  3.0000    3.5000    4.0000

%meantest3の平均値の計算結果
%  1.5000
%  2.5000
%  3.5000


%----------------------abs----------------------------
%abs: 配列の各要素に対して絶対値を返す.
%複素数なら a+biの絶対値sqrt{a^2+b^2}となる
abstest=[-1.,2.5,-3.5,1.+i,2-2i];
disp(abs(abstest));
%abs 実行例
% 1.0000    2.5000    3.5000    1.4142    2.8284

%------------------------exp--------------------------
%exp:e^{配列}とすることで配列の要素に対してe^{x}をの値を返す
exptest=[0.,1.,2.,3.,4.,5.];
exptest2=[i*pi,pi*i/2];
disp(exp(exptest));
disp(exp(exptest2));

%exp実行例
% 1.0000    2.7183    7.3891   20.0855   54.5982  148.4132
% -1.0000 + 0.0000i   0.0000 + 1.0000i
